#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```diff

module.storage_bucket["bucket_0"].data.google_project.project: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform planned the following actions, but then encountered a problem:

  # module.storage_bucket["bucket_0"].google_kms_crypto_key.terraform_state_bucket will be created
+   resource "google_kms_crypto_key" "terraform_state_bucket" {
+       destroy_scheduled_duration = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       import_only                = (known after apply)
+       key_ring                   = (known after apply)
+       name                       = "terraform-tfstate-key"
+       primary                    = (known after apply)
+       purpose                    = "ENCRYPT_DECRYPT"
+       rotation_period            = "86400s"
+       terraform_labels           = (known after apply)
    }

  # module.storage_bucket["bucket_0"].google_kms_key_ring.terraform_state will be created
+   resource "google_kms_key_ring" "terraform_state" {
+       id       = (known after apply)
+       location = "europe-southwest1"
+       name     = "terraform-tfstate-bucket-tfstate"
+       project  = "neon-slate-415009"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @PRubioDev, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request Main`*